app/views/customers/_form.html.erb

    <%= f.label :keyword %><br />
    <%= f.collection_select(:keyword_id, Keyword.all, :id, :title) %>
---
SELECT "keywords".* FROM "keywords"