app/controllers/keywords_controller.rb

  def index
    @keywords = Keyword.all
---
SELECT "keywords".* FROM "keywords"

  def show
    @keyword = Keyword.find(params[:id])
---
SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @keyword = Keyword.find(params[:id])
---
SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @keyword = Keyword.new(params[:keyword])

    respond_to do |format|
      if @keyword.save
---
INSERT INTO "keywords" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 10 Dec 2011 16:51:56 UTC +00:00], ["title", "Keyword 1"], ["updated_at", Sat, 10 Dec 2011 16:51:56 UTC +00:00]]

  def update
    @keyword = Keyword.find(params[:id])

    respond_to do |format|
      if @keyword.update_attributes(params[:keyword])
---
SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "keywords" SET "updated_at" = '2011-12-11 11:33:17.621880', "title" = 'Keyword 3' WHERE "keywords"."id" = 2