app/controllers/links_controller.rb

SELECT "customers".* FROM "customers"
---
  def index
    @links = Link.find(:all, :order => 'url')
    @domains = show_domains @links
    @customers = Customer.all

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @link = Link.find(params[:id])

INSERT INTO "links" ("created_at", "keyword_id", "status", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 11 Dec 2011 12:16:07 UTC +00:00], ["keyword_id", 1], ["status", ""], ["updated_at", Sun, 11 Dec 2011 12:16:07 UTC +00:00], ["url", ""]]
---
  def create
    @link = Link.new(params[:link])

    respond_to do |format|
      if @link.save

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "links" SET "status" = 'active', "updated_at" = '2011-12-11 13:10:53.131040' WHERE "links"."id" = 6
---
  def update
    @link = Link.find(params[:id])
    @link.update_attributes params[:link]

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 2]]
---
  def destroy
    @link = Link.find(params[:id])
    @link.destroy